# Project 8-1: Analyze the ramen data

In [1]:
# https://www.kaggle.com/residentmario/ramen-ratings
import pandas as pd
import seaborn as sns

## Tasks

In [2]:
# 1
data = pd.read_csv('ramen-ratings.csv')
data.head()

,Brand,Variety,Style,Country,Stars
0,New Touch,T's Restaurant Tantanmen,Cup,Japan,3.75
1,Just Way,Noodles Spicy Hot Sesame Spicy Hot Sesame Guan...,Pack,Taiwan,1.00
2,Nissin,Cup Noodles Chicken Vegetable,Cup,USA,2.25
3,Wei Lih,GGE Ramen Snack Tomato Flavor,Pack,Taiwan,2.75
4,Ching's Secret,Singapore Curry,Pack,India,3.75

In [3]:
# 2
data.groupby(['Country','Brand','Style']).mean()

                                 Stars
Country   Brand        Style
Australia Fantastic    Cup    3.041667
          Maggi        Pack   5.000000
          Singa-Me     Cup    2.833333
          Suimin       Cup    3.287500
          Trident      Pack   2.750000
...                                ...
Vietnam   Vifon        Pack   2.877273
          Vina Acecook Bowl   3.812500
                       Cup    2.500000
                       Pack   3.535714
                       Tray   3.500000

[578 rows x 1 columns]

In [4]:
# 3
data.groupby(['Country','Brand','Style']).agg(['mean','count'])

                                 Stars
                                  mean count
Country   Brand        Style
Australia Fantastic    Cup    3.041667     6
          Maggi        Pack   5.000000     1
          Singa-Me     Cup    2.833333     3
          Suimin       Cup    3.287500     8
          Trident      Pack   2.750000     4
...                                ...   ...
Vietnam   Vifon        Pack   2.877273    22
          Vina Acecook Bowl   3.812500     4
                       Cup    2.500000     1
                       Pack   3.535714    28
                       Tray   3.500000     1

[578 rows x 2 columns]

In [5]:
# 4
data.pivot_table(index='Country', columns='Style', values='Stars', aggfunc='mean')

Style          Bar      Bowl   Box  Can       Cup      Pack      Tray
Country
Australia      NaN       NaN   NaN  NaN  3.120588  3.200000       NaN
Bangladesh     NaN       NaN   NaN  NaN       NaN  3.714286       NaN
Brazil         NaN       NaN   NaN  NaN  4.500000  4.250000       NaN
Cambodia       NaN       NaN   NaN  NaN       NaN  4.200000       NaN
Canada         NaN  2.281250   NaN  NaN  1.970588  2.515625       NaN
China          NaN  3.527778   NaN  NaN  2.859375  3.538776  2.583333
Colombia       NaN       NaN   NaN  NaN  3.083333  3.500000       NaN
Dubai          NaN       NaN   NaN  NaN       NaN  3.583333       NaN
Estonia        NaN       NaN   NaN  NaN       NaN  3.500000       NaN
Fiji           NaN       NaN   NaN  NaN       NaN  3.875000       NaN
Finland        NaN       NaN   NaN  NaN       NaN  3.583333       NaN
Germany        NaN       NaN   NaN  NaN  3.704545  3.593750       NaN
Ghana          NaN       NaN   NaN  NaN       NaN  3.500000       NaN
Holland        NaN       NaN   NaN  NaN       NaN  3.562500       NaN
Hong Kong      NaN  3.735000   NaN  NaN  4.039474  3.702239  3.625000
Hungary        NaN       NaN   NaN  NaN       NaN  3.611111       NaN
India          NaN       NaN   NaN  NaN  2.583333  3.482143       NaN
Indonesia      NaN       NaN  4.25  NaN  3.940476  4.091346       NaN
Japan          NaN  4.140278  5.00  NaN  3.940816  3.801613  4.375000
Malaysia       NaN  4.281250  5.00  NaN  4.011905  4.156452       NaN
Mexico         NaN       NaN   NaN  NaN  3.733333  3.725000       NaN
Myanmar        NaN       NaN   NaN  NaN  4.083333  3.909091       NaN
Nepal          NaN       NaN   NaN  NaN       NaN  3.553571       NaN
Netherlands    NaN       NaN   NaN  NaN  1.333333  2.770833       NaN
Nigeria        NaN       NaN   NaN  NaN       NaN  1.500000       NaN
Pakistan       NaN       NaN   NaN  NaN       NaN  3.000000       NaN
Philippines    NaN  3.375000   NaN  NaN  2.937500  3.363636       NaN
Poland         NaN       NaN   NaN  NaN       NaN  3.625000       NaN
Sarawak        NaN       NaN   NaN  NaN       NaN  4.333333       NaN
Singapore      NaN  4.096154   NaN  NaN  3.925926  4.210145       NaN
South Korea    NaN  3.865809   NaN  NaN  3.500000  3.857459  3.479167
Sweden         NaN       NaN   NaN  NaN       NaN  3.250000       NaN
Taiwan         NaN  3.263514   NaN  NaN  3.250000  3.761326  3.333333
Thailand       NaN  3.142045   NaN  NaN  3.588542  3.386598  3.750000
UK             NaN  3.250000   NaN  NaN  2.978125  3.000000       NaN
USA            5.0  3.400000  1.50  3.5  3.376786  3.554688  3.408654
United States  NaN       NaN   NaN  NaN       NaN  3.750000       NaN
Vietnam        NaN  3.362500   NaN  NaN  2.656250  3.183333  3.750000

In [6]:
# 5
data_grouped = data.groupby('Country').sum()
data_grouped.Stars.rank(ascending=False)

Country
Australia        18.0
Bangladesh       24.0
Brazil           25.0
Cambodia         26.0
Canada           17.0
China             7.0
Colombia         27.0
Dubai            32.5
Estonia          35.5
Fiji             28.0
Finland          32.5
Germany          15.0
Ghana            35.5
Holland          30.0
Hong Kong         8.0
Hungary          22.0
India            14.0
Indonesia         9.0
Japan             1.0
Malaysia          6.0
Mexico           16.0
Myanmar          19.0
Nepal            20.0
Netherlands      21.0
Nigeria          38.0
Pakistan         23.0
Philippines      13.0
Poland           29.0
Sarawak          31.0
Singapore        10.0
South Korea       2.0
Sweden           34.0
Taiwan            4.0
Thailand          5.0
UK               12.0
USA               3.0
United States    37.0
Vietnam          11.0
Name: Stars, dtype: float64

In [7]:
# 6
pd.cut(data.Stars, bins=11, labels=[0,.5,1,1.5,2,2.5,3,3.5,4,4.5,5]).value_counts()

4.0    748
3.5    509
5.0    450
4.5    284
3.0    269
2.0     91
2.5     69
1.5     65
0.0     38
1.0     38
0.5     16
Name: Stars, dtype: int64

In [8]:
# 7
pd.qcut(data.Stars, q=5, labels=['Terrible','Bad','Mediocre','Good','Excellent']).value_counts()

Mediocre     749
Terrible     583
Bad          511
Excellent    450
Good         284
Name: Stars, dtype: int64

## Questions

In [9]:
# 1
data_grouped.nlargest(n=5, columns='Stars')

                Stars
Country
Japan        1401.525
South Korea  1163.700
USA          1116.625
Taiwan        821.050
Thailand      646.500

In [10]:
# 2
data.query('Style == "Can"').Country

66    USA
Name: Country, dtype: object